Revit 2026 API

# Glazing Class

---

A static class that provides access to the property names that appear in the Glazing visual asset schema.

SystemObject Autodesk.Revit.DB.VisualGlazing

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Glazing
```
```vb
Public NotInheritable Class Glazing
```
```cpp
public ref class Glazing abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Glazing = class end
```

The Glazing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Glazing" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Glazing" schema. |
|  | GlazingColorByObject | The property labeled "Color By Object" from the "Glazing" schema. |
|  | GlazingNoLevels | The property labeled "Sheets of Glass" from the "Glazing" schema. |
|  | GlazingReflectance | The property labeled "Reflectance" from the "Glazing" schema. |
|  | GlazingTransmittanceColor | The property labeled "Color" from the "Glazing" schema. |
|  | GlazingTransmittanceMap | The property labeled "Custom Color" from the "Glazing" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace